---
title: AssetPropertyDoubleArray3d
classe: Autodesk.Revit.DB.Visual.AssetPropertyDoubleArray3d
namespace: Autodesk.Revit.DB.Visual
eredita: Autodesk.Revit.DB.Visual.AssetProperty
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 4
---

# AssetPropertyDoubleArray3d

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `IList<Double> GetValueAsDoubles()` | `assetPropertyDoubleArray3d.GetValueAsDoubles()` | IList<Double> |
| `XYZ GetValueAsXYZ()` | `assetPropertyDoubleArray3d.GetValueAsXYZ()` | XYZ |
| `Boolean IsValidValue(XYZ)` | `assetPropertyDoubleArray3d.IsValidValue(xyz)` | Boolean |
| `Void SetValueAsXYZ(XYZ)` | `assetPropertyDoubleArray3d.SetValueAsXYZ(xyz)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```